{
  "tradingName": "Relevant Experience for EP-AIP-PAP",
  "organizationChildRelationship": [
    {
      "tradingName": "Java",
      "account": [
        {
          "name": "AnyLogic Professional Simulation Software",
          "product": { "name": "In the Simulation team at PwC, we used AnyLogic Professional, which is java-based. The majority of my work consisted of modifying simulations using Java, and creating/modifying API's." }
        }
      ],
      "organizationChildRelationship": [
        {
          "tradingName": "Computer Science Course",
          "account": [
            {
              "name": "2D Platformer Networked Game",
              "product": { "name": "In a group at University, we created a networked platformer game using Java, with only JavaFX." }
            },
            {
              "name": "Algorithms",
              "product": { "name": "Implemented a variety of searching and sorting algorithms, such as Dijkstras algorithm, to assist in completing university assignments." }
            }
          ]
        }
      ]
    },
    {
      "tradingName": "Javascript",
      "account": [
        {
          "name": "ReactJS",
          "product": { "name": "Used for the front-end of the full stack product I created at PwC. Also embedded PowerBI into the wesbite." }
        },
        {
          "name": "NodeJS/ ExpressJS",
          "product": { "name": "Used to create the back-end for the product I built at PwC. Integrated multiple micro-services I created for the product." }
        }
        
      ]
    },
    {
      "tradingName": "Linux",
      "account": [
        {
          "name": "Personal OS",
          "product": { "name": "My personal laptop has an Ubuntu VM which I use for most Computer Science projects." }
        },
        {
          "name": "Bash",
          "product": { "name": "Using both MacOS and Linux, I'm comfortable using bash, and have written some basic bash scripts for Computer Science projects." }
        }
      ]
    },
    {
      "tradingName": "Distributed Computing",
      "account": [
        {
          "name": "Computer Science course",
          "product": { "name": "This year I completed a Networking/ Distributing Systems course. While it was theoretical, we learnt about leader rlection in a token ring and consensus regarding both synchronous and unsynchronous systems." }
        }
      ]
    },
    {
      "tradingName": "Git",
      "account": [
        {
          "name": "Github",
          "product": { "name": "I have used GitHub in various Computer Science projects." }
        },
        {
          "name": "GitLab",
          "product": { "name": "GitLab is the primary git system used by my University, and as such I have used it for many projects and am currently using it for my final year project." }
        },
        {
          "name": "Azure DevOps",
          "product": { "name": "I used git within Azure DevOps for my main project at PwC." }
        }
      ]
    },
    {
      "tradingName": "Databases",
      "account": [
        {
          "name": "SQL",
          "product": { "name": "For the project at PwC, I used SQL Server hosted within Google Cloud to create for a relational database. In the past I have also sed mySQL and SQLlite." }
        },
        {
          "name": "MongoDB",
          "product": { "name": "Before using SQL Server for the project I worked on at PwC, I first implemented MongoDB into the stack. Eventually I pivotted to SQL as the advantages of a relational database were needed." }
        }
      ]
    }
  ]
}
